In [77]:
import pandas as pd
import numpy as np

In [78]:
df= pd.DataFrame({"name" :['Harsh',"varun",'34'] , "age" :['22', '25',34]})

In [79]:
df.dtypes

name    object
age     object
dtype: object

In [80]:
df['age']= pd.to_numeric(df['age'] ,errors ='coerce' )

In [81]:
df

    name  age
0  Harsh   22
1  varun   25
2     34   34

In [82]:
df.dtypes

name    object
age      int64
dtype: object

In [83]:
# df['name']= pd.to_numeric(df['name'] ,errors ='coerce' )

In [84]:
# df

In [85]:
df['name']= pd.to_numeric(df['name'] ,errors ='ignore' )

In [86]:
df

    name  age
0  Harsh   22
1  varun   25
2     34   34

In [87]:
df.dtypes

name    object
age      int64
dtype: object

In [88]:
df2= pd.DataFrame({"name" :['Harsh',"varun",'34'] , "age" :['22', '25',34]})

In [89]:
df2 = df2.convert_dtypes()

In [90]:
df2.dtypes

name    string[python]
age             object
dtype: object

In [91]:
date_strings = ['2023-01-01', '2023-02-30', 'invalid_date', '2023-03-15']

In [92]:
df=pd.DataFrame(date_strings)

In [93]:
df.dtypes

0    object
dtype: object

In [144]:
df = pd.DataFrame({
    'date_str': ['2023-01-01', '2023-01-02', '2023-01-03', 'invalid-date', '2023/04/01']})

In [145]:
df

       date_str
0    2023-01-01
1    2023-01-02
2    2023-01-03
3  invalid-date
4    2023/04/01

In [146]:
df['date']=pd.to_datetime(df["date_str"] , errors="coerce")

In [147]:
df

       date_str       date
0    2023-01-01 2023-01-01
1    2023-01-02 2023-01-02
2    2023-01-03 2023-01-03
3  invalid-date        NaT
4    2023/04/01        NaT

In [148]:
df.where(df['date']!=pd.NaT ,other=2)

       date_str       date
0    2023-01-01 2023-01-01
1    2023-01-02 2023-01-02
2    2023-01-03 2023-01-03
3  invalid-date        NaT
4    2023/04/01        NaT

In [149]:
df.dtypes

date_str            object
date        datetime64[ns]
dtype: object

In [130]:
df['date'].astype(object)

0    2023-01-01 00:00:00
1    2023-01-02 00:00:00
2    2023-01-03 00:00:00
3                    NaT
4                    NaT
Name: date, dtype: object

In [129]:
df['date'].dtypes

dtype('<M8[ns]')

In [137]:
df=df.where(df['date']!=pd.NaT , other ='2022-2-27')

In [138]:
df

       date_str       date
0    2023-01-01 2023-01-01
1    2023-01-02 2023-01-02
2    2023-01-03 2023-01-03
3  invalid-date        NaT
4    2023/04/01        NaT

In [141]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'date': [pd.Timestamp('2023-01-01'), pd.NaT, pd.Timestamp('2023-05-01')],
    
})

print("Original DataFrame:")
print(df)

# Replace NaT values with '2022-02-28', keep actual dates.
# Condition: df['date'] != pd.NaT (True for actual dates, False for NaT)
# Keep original values where condition is True (actual date)
# Replace with pd.Timestamp('2022-02-28') where condition is False (NaT)
df['new_column'] = df['date'].where(df['date'] != pd.NaT, pd.Timestamp('2022-02-28'))
print("\nReplacing NaT values with '2022-02-28', keeping actual dates:")
print(df)

Original DataFrame:
        date
0 2023-01-01
1        NaT
2 2023-05-01

Replacing NaT values with '2022-02-28', keeping actual dates:
        date new_column
0 2023-01-01 2023-01-01
1        NaT        NaT
2 2023-05-01 2023-05-01

In [142]:
df

        date new_column
0 2023-01-01 2023-01-01
1        NaT        NaT
2 2023-05-01 2023-05-01